Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/include/pio/pic32cm1216ls60064.h
#define PIN_PB16E_TC2_WO0                          _UL_(48)    
#define MUX_PB16E_TC2_WO0                          _UL_(4)     
#define PINMUX_PB16E_TC2_WO0                       ((PIN_PB16E_TC2_WO0 << 16) | MUX_PB16E_TC2_WO0)
#define PORT_PB16E_TC2_WO0                         (_UL_(1) << 16)

#define PIN_PA19E_TC2_WO1                          _UL_(19)    
#define MUX_PA19E_TC2_WO1                          _UL_(4)     
#define PINMUX_PA19E_TC2_WO1                       ((PIN_PA19E_TC2_WO1 << 16) | MUX_PA19E_TC2_WO1)
#define PORT_PA19E_TC2_WO1                         (_UL_(1) << 19)

#define PIN_PB03E_TC2_WO1                          _UL_(35)    
#define MUX_PB03E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB03E_TC2_WO1                       ((PIN_PB03E_TC2_WO1 << 16) | MUX_PB03E_TC2_WO1)
#define PORT_PB03E_TC2_WO1                         (_UL_(1) << 3)

#define PIN_PB17E_TC2_WO1                          _UL_(49)    
#define MUX_PB17E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB17E_TC2_WO1                       ((PIN_PB17E_TC2_WO1 << 16) | MUX_PB17E_TC2_WO1)
#define PORT_PB17E_TC2_WO1                         (_UL_(1) << 17)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA04E_TCC0_WO0                         _UL_(4)     
#define MUX_PA04E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA04E_TCC0_WO0                      ((PIN_PA04E_TCC0_WO0 << 16) | MUX_PA04E_TCC0_WO0)
#define PORT_PA04E_TCC0_WO0                        (_UL_(1) << 4)

#define PIN_PA08E_TCC0_WO0                         _UL_(8)     
#define MUX_PA08E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA08E_TCC0_WO0                      ((PIN_PA08E_TCC0_WO0 << 16) | MUX_PA08E_TCC0_WO0)
#define PORT_PA08E_TCC0_WO0                        (_UL_(1) << 8)

#define PIN_PB30E_TCC0_WO0                         _UL_(62)    
#define MUX_PB30E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PB30E_TCC0_WO0                      ((PIN_PB30E_TCC0_WO0 << 16) | MUX_PB30E_TCC0_WO0)
#define PORT_PB30E_TCC0_WO0                        (_UL_(1) << 30)

#define PIN_PA05E_TCC0_WO1                         _UL_(5)     
#define MUX_PA05E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA05E_TCC0_WO1                      ((PIN_PA05E_TCC0_WO1 << 16) | MUX_PA05E_TCC0_WO1)
#define PORT_PA05E_TCC0_WO1                        (_UL_(1) << 5)

#define PIN_PA09E_TCC0_WO1                         _UL_(9)     
#define MUX_PA09E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA09E_TCC0_WO1                      ((PIN_PA09E_TCC0_WO1 << 16) | MUX_PA09E_TCC0_WO1)
#define PORT_PA09E_TCC0_WO1                        (_UL_(1) << 9)

#define PIN_PB31E_TCC0_WO1                         _UL_(63)    
#define MUX_PB31E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PB31E_TCC0_WO1                      ((PIN_PB31E_TCC0_WO1 << 16) | MUX_PB31E_TCC0_WO1)
#define PORT_PB31E_TCC0_WO1                        (_UL_(1) << 31)

#define PIN_PA10J_TCC0_WO2                         _UL_(10)    
#define MUX_PA10J_TCC0_WO2                         _UL_(9)     
#define PINMUX_PA10J_TCC0_WO2                      ((PIN_PA10J_TCC0_WO2 << 16) | MUX_PA10J_TCC0_WO2)
#define PORT_PA10J_TCC0_WO2                        (_UL_(1) << 10)

#define PIN_PA18J_TCC0_WO2                         _UL_(18)    
#define MUX_PA18J_TCC0_WO2                         _UL_(9)     
#define PINMUX_PA18J_TCC0_WO2                      ((PIN_PA18J_TCC0_WO2 << 16) | MUX_PA18J_TCC0_WO2)
#define PORT_PA18J_TCC0_WO2                        (_UL_(1) << 18)

#define PIN_PA11J_TCC0_WO3                         _UL_(11)    
#define MUX_PA11J_TCC0_WO3                         _UL_(9)     
#define PINMUX_PA11J_TCC0_WO3                      ((PIN_PA11J_TCC0_WO3 << 16) | MUX_PA11J_TCC0_WO3)
#define PORT_PA11J_TCC0_WO3                        (_UL_(1) << 11)

#define PIN_PA19J_TCC0_WO3                         _UL_(19)    
#define MUX_PA19J_TCC0_WO3                         _UL_(9)     
#define PINMUX_PA19J_TCC0_WO3                      ((PIN_PA19J_TCC0_WO3 << 16) | MUX_PA19J_TCC0_WO3)
#define PORT_PA19J_TCC0_WO3                        (_UL_(1) << 19)

#define PIN_PA22J_TCC0_WO4                         _UL_(22)    
#define MUX_PA22J_TCC0_WO4                         _UL_(9)     
#define PINMUX_PA22J_TCC0_WO4                      ((PIN_PA22J_TCC0_WO4 << 16) | MUX_PA22J_TCC0_WO4)
#define PORT_PA22J_TCC0_WO4                        (_UL_(1) << 22)

#define PIN_PB16J_TCC0_WO4                         _UL_(48)    
#define MUX_PB16J_TCC0_WO4                         _UL_(9)     
#define PINMUX_PB16J_TCC0_WO4                      ((PIN_PB16J_TCC0_WO4 << 16) | MUX_PB16J_TCC0_WO4)
#define PORT_PB16J_TCC0_WO4                        (_UL_(1) << 16)

#define PIN_PA14J_TCC0_WO4                         _UL_(14)    
#define MUX_PA14J_TCC0_WO4                         _UL_(9)     
#define PINMUX_PA14J_TCC0_WO4                      ((PIN_PA14J_TCC0_WO4 << 16) | MUX_PA14J_TCC0_WO4)
#define PORT_PA14J_TCC0_WO4                        (_UL_(1) << 14)

#define PIN_PA15J_TCC0_WO5                         _UL_(15)    
#define MUX_PA15J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PA15J_TCC0_WO5                      ((PIN_PA15J_TCC0_WO5 << 16) | MUX_PA15J_TCC0_WO5)
#define PORT_PA15J_TCC0_WO5                        (_UL_(1) << 15)

#define PIN_PA23J_TCC0_WO5                         _UL_(23)    
#define MUX_PA23J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PA23J_TCC0_WO5                      ((PIN_PA23J_TCC0_WO5 << 16) | MUX_PA23J_TCC0_WO5)
#define PORT_PA23J_TCC0_WO5                        (_UL_(1) << 23)

#define PIN_PB17J_TCC0_WO5                         _UL_(49)    
#define MUX_PB17J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PB17J_TCC0_WO5                      ((PIN_PB17J_TCC0_WO5 << 16) | MUX_PB17J_TCC0_WO5)
#define PORT_PB17J_TCC0_WO5                        (_UL_(1) << 17)

#define PIN_PA12J_TCC0_WO6                         _UL_(12)    
#define MUX_PA12J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA12J_TCC0_WO6                      ((PIN_PA12J_TCC0_WO6 << 16) | MUX_PA12J_TCC0_WO6)
#define PORT_PA12J_TCC0_WO6                        (_UL_(1) << 12)

#define PIN_PA16J_TCC0_WO6                         _UL_(16)    
#define MUX_PA16J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA16J_TCC0_WO6                      ((PIN_PA16J_TCC0_WO6 << 16) | MUX_PA16J_TCC0_WO6)
#define PORT_PA16J_TCC0_WO6                        (_UL_(1) << 16)

#define PIN_PA20J_TCC0_WO6                         _UL_(20)    
#define MUX_PA20J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA20J_TCC0_WO6                      ((PIN_PA20J_TCC0_WO6 << 16) | MUX_PA20J_TCC0_WO6)
#define PORT_PA20J_TCC0_WO6                        (_UL_(1) << 20)

#define PIN_PB12J_TCC0_WO6                         _UL_(44)    
#define MUX_PB12J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PB12J_TCC0_WO6                      ((PIN_PB12J_TCC0_WO6 << 16) | MUX_PB12J_TCC0_WO6)
#define PORT_PB12J_TCC0_WO6                        (_UL_(1) << 12)

#define PIN_PA13J_TCC0_WO7                         _UL_(13)    
#define MUX_PA13J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PA13J_TCC0_WO7                      ((PIN_PA13J_TCC0_WO7 << 16) | MUX_PA13J_TCC0_WO7)
#define PORT_PA13J_TCC0_WO7                        (_UL_(1) << 13)

#define PIN_PA17J_TCC0_WO7                         _UL_(17)    
#define MUX_PA17J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PA17J_TCC0_WO7                      ((PIN_PA17J_TCC0_WO7 << 16) | MUX_PA17J_TCC0_WO7)
#define PORT_PA17J_TCC0_WO7                        (_UL_(1) << 17)

